Data Transfomation and Analysis

In [2]:
import pandas as pd

In [3]:
df = pd.read_excel(r"D:\CPSIT\Practice\Pandas\loan_data.xlsx")

In [ ]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001722,Male,Yes,0,Graduate,No,150,1800.0,135.0,360.0,1.0,Rural,N
1,LP002502,Female,Yes,2,Not Graduate,NaN,210,2917.0,98.0,360.0,1.0,Semiurban,Y
2,LP002949,Female,No,3+,Graduate,NaN,416,41667.0,350.0,180.0,NaN,Urban,N
3,LP002603,Female,No,0,Graduate,No,645,3683.0,113.0,480.0,1.0,Rural,Y
4,LP001644,NaN,Yes,0,Graduate,Yes,674,5296.0,168.0,360.0,1.0,Rural,Y

**1. Sorting the data**

In [6]:
df.sort_values(by="Loan_ID", ascending = True)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
466,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
379,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
174,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
113,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
471,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
158,LP002978,Female,No,0,Graduate,No,2900,0.0,71.0,360.0,1.0,Rural,Y
340,LP002979,Male,Yes,3+,Graduate,No,4106,0.0,40.0,180.0,1.0,Rural,Y
531,LP002983,Male,Yes,1,Graduate,No,8072,240.0,253.0,360.0,1.0,Urban,Y
522,LP002984,Male,Yes,2,Graduate,No,7583,0.0,187.0,360.0,1.0,Urban,Y
384,LP002990,Female,No,0,Graduate,Yes,4583,0.0,133.0,360.0,0.0,Semiurban,N

In [7]:
df.sort_values(by = ["Loan_ID", "ApplicantIncome"], ascending = [True, True])

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
466,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
379,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
174,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
113,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
471,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y
...,...,...,...,...,...,...,...,...,...,...,...,...,...
158,LP002978,Female,No,0,Graduate,No,2900,0.0,71.0,360.0,1.0,Rural,Y
340,LP002979,Male,Yes,3+,Graduate,No,4106,0.0,40.0,180.0,1.0,Rural,Y
531,LP002983,Male,Yes,1,Graduate,No,8072,240.0,253.0,360.0,1.0,Urban,Y
522,LP002984,Male,Yes,2,Graduate,No,7583,0.0,187.0,360.0,1.0,Urban,Y
384,LP002990,Female,No,0,Graduate,Yes,4583,0.0,133.0,360.0,0.0,Semiurban,N

**2. Value counts** - is one of the quickest ways to explore categorical data. It returns a Series containing counts of unique values, effectively creating a frequency table.

In [8]:
df['Gender'].value_counts()

Gender
Male      489
Female    112
Name: count, dtype: int64

In [10]:
df['Education'].value_counts()

Education
Graduate        480
Not Graduate    134
Name: count, dtype: int64

**3. Grouping Data**

**GroupBy**- It is a flexible framework (Split-Apply-Combine) that lets you group data and calculate any statistic (sum, mean, max, standard deviation) on other columns.

In [11]:
df.groupby(['Gender'])['ApplicantIncome'].mean()

Gender
Female    4643.473214
Male      5446.460123
Name: ApplicantIncome, dtype: float64

**4. Feature Engineering**- Extracting new columns from existing columns.

In [12]:
df['Valuable'] = "No"
df.loc[(df['ApplicantIncome'] > 2000)& (df['CoapplicantIncome']>5000), 'Valuable'] = "Yes"

In [13]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status,Valuable
0,LP001722,Male,Yes,0,Graduate,No,150,1800.0,135.0,360.0,1.0,Rural,N,No
1,LP002502,Female,Yes,2,Not Graduate,NaN,210,2917.0,98.0,360.0,1.0,Semiurban,Y,No
2,LP002949,Female,No,3+,Graduate,NaN,416,41667.0,350.0,180.0,NaN,Urban,N,No
3,LP002603,Female,No,0,Graduate,No,645,3683.0,113.0,480.0,1.0,Rural,Y,No
4,LP001644,NaN,Yes,0,Graduate,Yes,674,5296.0,168.0,360.0,1.0,Rural,Y,No

In [14]:
df['Valuable'].value_counts()

Valuable
No     590
Yes     24
Name: count, dtype: int64

In [4]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 614 entries, 0 to 613
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            614 non-null    str
 1   Gender             601 non-null    str
 2   Married            611 non-null    str
 3   Dependents         599 non-null    object
 4   Education          614 non-null    str
 5   Self_Employed      582 non-null    str
 6   ApplicantIncome    614 non-null    int64
 7   CoapplicantIncome  614 non-null    float64
 8   LoanAmount         592 non-null    float64
 9   Loan_Amount_Term   600 non-null    float64
 10  Credit_History     564 non-null    float64
 11  Property_Area      614 non-null    str
 12  Loan_Status        614 non-null    str
dtypes: float64(4), int64(1), object(1), str(7)
memory usage: 62.5+ KB

In [5]:
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001722,Male,Yes,0,Graduate,No,150,1800.0,135.0,360.0,1.0,Rural,N
1,LP002502,Female,Yes,2,Not Graduate,NaN,210,2917.0,98.0,360.0,1.0,Semiurban,Y
2,LP002949,Female,No,3+,Graduate,NaN,416,41667.0,350.0,180.0,NaN,Urban,N
3,LP002603,Female,No,0,Graduate,No,645,3683.0,113.0,480.0,1.0,Rural,Y
4,LP001644,NaN,Yes,0,Graduate,Yes,674,5296.0,168.0,360.0,1.0,Rural,Y

**PIVOT TABLES**

In [7]:
pd.pivot_table(data = df, index = ['Gender', 'Married'], columns = ['Education'], values = ['ApplicantIncome'])

               ApplicantIncome
Education             Graduate Not Graduate
Gender Married
Female No          4337.196970  5289.142857
       Yes         5246.920000  3091.000000
Male   No          5710.777778  3720.387097
       Yes         6106.112727  3595.914634

**Merging Datasets**

In [8]:
students = pd.DataFrame({
    'student_id': [101,102,103,104],
    'name' : ['Ramesh', 'Suresh', 'Mahesh', 'Naresh'],
    'city': ['Hyderabad', 'Vijayawada', 'Guntur', 'Nellore']
})
marks = pd.DataFrame({
    'student_id': [101, 102, 103, 105],
    'subject': ['Maths', 'Maths', 'Science', 'Maths'],
    'marks': [85,78,88,90]
})

In [9]:
students.head()

   student_id    name        city
0         101  Ramesh   Hyderabad
1         102  Suresh  Vijayawada
2         103  Mahesh      Guntur
3         104  Naresh     Nellore

In [10]:
marks.head()

   student_id  subject  marks
0         101    Maths     85
1         102    Maths     78
2         103  Science     88
3         105    Maths     90

In [13]:
merged_df = pd.merge(students, marks, on = 'student_id', how = 'inner')

In [14]:
merged_df

   student_id    name        city  subject  marks
0         101  Ramesh   Hyderabad    Maths     85
1         102  Suresh  Vijayawada    Maths     78
2         103  Mahesh      Guntur  Science     88

In [12]:
pd.merge(students, marks, on = 'student_id', how = 'outer')

   student_id    name        city  subject  marks
0         101  Ramesh   Hyderabad    Maths   85.0
1         102  Suresh  Vijayawada    Maths   78.0
2         103  Mahesh      Guntur  Science   88.0
3         104  Naresh     Nellore      NaN    NaN
4         105     NaN         NaN    Maths   90.0

In [15]:
merged_file = merged_df.to_csv(r"D:\CPSIT\Practice\Pandas\merged_data.csv")